# دانستن ورژن پایتون نصب شده در ویندوز، در کامند پرامپت مینویسیم:
# python --version

# --------------------------------------------------------------------------------------------------
# نوشتن کد در محیط کامند پرامپت => دستور زیر رو مینویسیم و اینتر میکنیم
# python 
# حالا میتونیم کدنویسی کنیم البته کدهای کوتاه
# کد روبرو رو مینویسیم و اینتر میکنیم تا از محیط کدنویسی پایتون خارج شود => exit()

# --------------------------------------------------------------------------------------------------
# دستور باز شدن ترمینال در ویژوال استدیو کد => ctrl + `

# --------------------------------------------------------------------------------------------------
# print(): دستور چاپ 

print('Hello, World!')

# --------------------------------------------------------------------------------------------------
# type(): دستور برگرداندن نوع دیتا

print(type(5))   # <class 'int'>
print(type(5.3)) # <class 'float'>
print(type(5j))  # <class 'complex'>
print(type('MohamadMahdi')) #<class 'str'>

# --------------------------------------------------------------------------------------------------
# اعمال ریاضی:

print(3 + 6) # 9 خروجی جمع دو عدد صحیح عدد صحیح است
print(6 + 7.2) # 13.2 خروجی جمع عدد صحیح با عدد اعشاری، عدد اعشاری است
print(6 + 7.0) # 13.0 خروجی جمع عدد صحیح با عدد اعشاری با پوینت 0، عدد اعشاری است
print(6.9 + 7.0) # 13.9 خروجی جمع دو عدد اعشاری، عدد اعشاری است
print((1 + 3) * 4 / 2) # 8.0 قواعد ریاضی مثل اولویت های پرانتز، ضرب و تقسیم و جمع و ضرب رعایت میشود