# + - * / :

print(4 + 7) # 11
print(7 - 4) # 3
print(4 * 7) # 28
print(49 / 7) # 7.0

# --------------------------------------------------------------------------------------------------
# ** :

print(3 ** 2) # 9 کاربرد ** بعنوان توان
print(49 ** 0.5) # 7 کاربرد ** بعنوان جذر

# --------------------------------------------------------------------------------------------------
#opeartor % : بدست آوردن باقی مانده ی یک تقسیم

print(68 / 6) # 11.333333333333334 بخش پذیر نیست ولی این تقسیم باقی مانده ای دارد و در خط بعد میخواهیم بدست بیاریم
print(68 % 6)  # 2 باقی مانده تقسیم عدد شصت و هشت بر عدد شش
print(78 % 2) # حاصل این باقی مانده چون 0 شده، پس 78 بر 2 بخش پذیر است

# کاربرد مهم دیگر این اپراتور چک کردن زوج یا فرد بودن یک عدد هست که خیلی در پروژه ها کاربرد دارد

# بدست آوردن قسمت صحیح یک تقسیم با دانسته های فعلی:
print((68 - (68 % 6)) / 6) # 11.0

# --------------------------------------------------------------------------------------------------
# // : بدست آوردن قسمت صحیح یک تقسیم

print(68 / 6) # 11.333333333333334  نتیجه تقسیم به همراه اعشار
print(68 // 6) # 11 نتیجه ی تقسیم فقط با قسمت صحیح آن 