# تعریف متغییر:

a = 100
b = 200
print(a)
print(b)

# --------------------------------------------------------------------------------------------------
# تغییر یک متغییر:

a = 100
b = 200
a = 360
c = b # ریختن متغییری در متغییر دیگر
print(a + b)
print(a + c)

# --------------------------------------------------------------------------------------------------
# تعریف همزمان متغییر ها:

w , z = 1000, 3000
print(w + z)

# --------------------------------------------------------------------------------------------------
# تغییر مقدار متغییر و ریختن آن درون خودش:

myNumber = 100
myNumber = myNumber + 40
print(myNumber)

# --------------------------------------------------------------------------------------------------
# نامگذاری درست برای متغییر ها:

# 1. نام متغییرهای ما باید شامل حروف انگلیسی، _ و اعداد باشند
# 2. حتما باید با حرف یا _ شروع شود
# 3. نمیتوان کارکتر های خاص رو درون آن استفاده کنیم

# --------------------------------------------------------------------------------------------------
# Name Conventions:

# Snake Case Variable Naming:
my_age = 30

# Camel Case Variable Naming:
myAge = 30

# Upper Camel Case Naming: این نوع در نامگذاری کلاس ها خیلی استفاده میشود
MyAge = 30

# Lower Case Variable Naming:
myage = 30

# ثابت ها را با حروف بزرگ مینویسند مثل عدد پی:
PI = 3.14

# در بعضی کد های اوپن سورس ممکنه اینجور نامگذاری هم مشاهده کنیم:
__no_touch__ = 10