# input() : در ترمینال میتونیم از کاربر مقدار دریافت کنیم

# ورودی دریافتی در هر صورتی رشته دریافت میشود

# --------------------------------------------------------------------------------------------------
# مثال: دریافت مقدار کیلومتر و تبدیل آن به مایل و چاپ در خروجی

print("how many kms do you want to convert?")

# مقدار دریافتی به فلوت تبدیل میشود - روش اول
# kms = float(input())

kms = input()

# در تقسیم مستقیم مقدار را به فلوت تبدیل میکنیم - روش دوم
miles = float(kms) / 1.60934

print(f"ok, converted data without round is : {miles}")
print(f"ok, converted data with round is: {round(miles, 2)}")

# --------------------------------------------------------------------------------------------------
# round(number, ndigits): برای رند کردن اعداد اعشاری استفاده میشود

# number: عدد که قرار هست رند شود
# ndigits: تعداد ارقام رند شده، یعنی تا چند رقم اعشار رند شود

print(round(14.231234758, 2))  # 14.23

# --------------------------------------------------------------------------------------------------
# مثال با ساختاری تمیزتر و با خوانایی بیشتر:

print("how many kms do you want to convert?")
kms = input()
miles = float(kms) / 1.60934
miles = round(miles, 3)
print(f"{kms} km is: {miles} miles")
