# is:

number = 4

if type(number) is int:
    print('this is true')
else:
    print('this is false')


# --------------------------------------------------------------------------------------------------
# Differences between == and is:

# یک قانون ساده برای به خاطر سپردن تفاوت این دو:
# ==    مقایسه مقدار
# is    مقایسه هویت (Identity)

# در پایتون ایز برای بررسی هویت شی استفاده میشود؛ یعنی آیا دو متغییر به همان شی در حافظه اشاره میکنند یا خیر
# اما علامت مساوی مساوی، برابری مقدار را چک میکند، یعنی آیا دو مقدار برابر هستند یا خیر

list_1 = ['a', 'b', 'c']
list_2 = list_1
list_3 = list(list_1)

print(list_1)  # ['a', 'b', 'c']
print(list_2)  # ['a', 'b', 'c']
print(list_3)  # ['a', 'b', 'c']

# لیست های دوم و سوم به طریقی دارند به لیست یک اشاره میکنند و مقادیرشون رو از لیست یک گرفته اند؛ حال میایم و مقایسه میکنیم:

print(list_1 == list_2)  # True
print(list_1 == list_3)  # True

# این ترو هایی که برگردانده شده، یعنی مقادیر این لیست ها دقیقا برابر هستند؛ حال بیاییم از ایز استفاده کنیم:

print(list_1 is list_2)  # True
print(list_1 is list_2)  # False

# چرا آخری فالس شد؟
# در بالا لیست دو برابر با همان آرایه لیست یک بود و به خودش اشاره میکند، اما لیست سوم، یک لیست جدید هست که فقط آیتم هایش را از لیست
# اول گرفته است، درسته مقادیرشون برابر هستند، اما لیست 3 همان لیست 1 نیست

# پس در نتیجه:
# the == operator => value are eaual
# the is operator => point to the same object


# --------------------------------------------------------------------------------------------------
# Truthiness & Falsiness:

# بعضی از مقادیر هستند که بصورت پیش فرض مقادیر بولین را دارا هستند با اینکه نوع بولین نیستند مثلا عدد صفر؛ که خروجی زیر فالس را برمیگرداند:

if 0:
    print('this is true')
else:
    print('this is false')  # خروجی این میشود

# یا موارد دیگر مثل آبجکت های خالی، یا رشته های خالی، تایپ نان:

if "":
    print('this is true')
else:
    print('this is false')  # خروجی این میشود


# یک مثال ساده برای کاربرد تروسینس و فالسینس: در مثال میگیم اگر مقدار متغییر کار رشته خالی نبود و مقدار داشت بیا و نمایشش بده

print('enter your favorite car: ')

car = input()

if car:
    print(f'your favorite car is: {car}')


# بطور خلاصه:

# falsyness => empty objects, zero or 0, empty string, None
