# List: یکی از تایپ های پایتون که میتواند مجموعه ای از آیتم ها را درون خودش داشته باشد

item1 = "python"
item2 = "django"
item3 = "mysql"
item4 = "html"

myList = [item1, item2, item3, item4]  # ['python', 'django', 'mysql', 'html']

print(myList)

# --------------------------------------------------------------------------------------------------
# functions in list:
# برای لیست، پایتون اومده یکسری فانکشن ها را قرار داده است

# len(obj):
# این فانکشن، یک  آبجکت دریافت میکند و تعداد آیتم های درونش را برمیگرداند

print(len(myList))  # 4

# --------------------------------------------------------------------------------------------------
# دسترسی به آیتمی خاص درون لیست بوسیله ایندکس هر آیتم:

print(myList[0])  # python
print(myList[len(myList) - 1])  # زمانی که بخواهیم آیتم آخر رو بدست بیاوریم
# print(myList[4])  # IndexError: list index out of range

# ایندکس منفی : از آخر شروع به پردازش میکند
print(myList[-1])  # html
print(myList[-2])  # mysql
print(myList[-3])  # django
print(myList[-4])  # python
# print(myList[-5])  # IndexError: list index out of range

# --------------------------------------------------------------------------------------------------
# زمانی که بخواهیم چک کنیم آیتمی خاص دورن لیست هست یا خیر:

is_exist_django = "django" in myList
print(is_exist_django)  # True

# --------------------------------------------------------------------------------------------------
# نحوه ایجاد لیست برای رنج:

myRange = range(20)
print(list(myRange)) # [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19]
