# List - for - while:

# --------------------------------------------------------------------------------------------------
# چاپ کردن تمامی آیتم های لیست بوسیله حلقه فور
# لازم نیست فقط آیتم ها از نوع رشته باشند، میتونیم از نوع دیگر داده ای هم استفاده کنیم:

myColors = ["red", "blue", "green", "gray", "yellow", "orange", 3.6]

for color in myColors:
    if type(color) == str:
        print(f"the color is: {color}")
    else:
        print(f"{color} is not a color!")

# --------------------------------------------------------------------------------------------------
# نحوه استفاده از حلقه وایل برای چاپ آیتم ها:

index = 0
while index < len(myColors):
    color = myColors[index]
    if type(color) == str:
        print(f"the color is: {color}")
    else:
        print(f"{color} is not a color!")

    index += 1

# در این مثال بخصوص که زده شد، استفاده از حلقه فور ساده تر هست، چون تعداد خطوط کد نویسی کمتر هست و سینتکس
# ساده تری هم دارد؛ اما یک وقت هایی پیش میاد که به ایندکس احتیاج داشته باشیم چون در حلقه فور نمیشود دسترسی داشت
# و در حلقه فور، خود آیتم را داریم و ایندکس آن را نداریم، به همین دلیل از وایل استفاده میکنیم
