# List Functions - part 2

myCourses = ["Python", "Kotlin", "Ionic", "Kotlin"]

print(myCourses)

# --------------------------------------------------------------------------------------------------
# clear: پاک کردن تمامی آیتم های درون لیست

myCourses.clear()

# --------------------------------------------------------------------------------------------------
# pop:

# اگر ایندکسی ندهیم از آخر لیست یکی پاک میکند:
myCourses.pop()

# میتونیم ایندکس بدهیم تا فقط آن را پاک کند:
myCourses.pop(1)

# میتونیم آیتمی که حذف شده رو بریزیم داخل متغییر مثلا:
first_item = myCourses.pop(0)
last_item = myCourses.pop()
print(myCourses)
print(f"first item is: {first_item}")
print(f"last item is: {last_item}")

# --------------------------------------------------------------------------------------------------
# remove: باید بهش مقدار بدهیم تا پاک کند

myCourses.remove("Kotlin")
print(myCourses)

# اگر مقداری که بهش میدیم درون لیست نباشد، ارور میدهد:
myCourses.remove("ionic")

# اگر هم از آیتمی دو تا مقدار یکسان باشد، میگردد به اولین آیتمی که پیدا کرد فقط آن را حذف میکند و به مابقی کاری ندارد
